cases/aeration/CaseC_Lateral/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    sideWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        phi             phi.air;
        value           uniform (0 0 0);
    }

	diffusers
	{
		type            uniformFixedValue;

		uniformValue    table
		(
			(0       (0 0 0))
			(60      (0 0 0.00408))
			(1200    (0 0 0.00408))
		);

		value           uniform (0 0 0);
	}
}

// ************************************************************************* //
