cases/aeration/CaseC_Lateral/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.air
    {
        nAlphaCorr      2;
        nAlphaSubCycles 4;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-6;
        relTol          0.05;

        maxIter         100;
    }

    p_rghFinal
    {
        $p_rgh;

        tolerance       1e-6;
        relTol          0;

        maxIter         200;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0.05;

        minIter         1;
        maxIter         100;
    }

        e.air
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-5;
        relTol          0.05;

        minIter         1;
        maxIter         100;
    }

    e.airFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-5;
        relTol          0;

        minIter         1;
        maxIter         200;
    }

    e.water
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-5;
        relTol          0.05;

        minIter         1;
        maxIter         100;
    }

    e.waterFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-5;
        relTol          0;

        minIter         1;
        maxIter         200;
    }

    "(k|epsilon|Theta).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0.05;

        minIter         1;
        maxIter         100;
    }
	
	DO
	{
		solver          smoothSolver;
		smoother        symGaussSeidel;

		tolerance       1e-8;
		relTol          0.01;

		minIter         1;
		maxIter         100;
	}
}

PIMPLE
{
    nOuterCorrectors 3;
    nCorrectors      1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}


// ************************************************************************* //
