cases/aeration/CaseC_Lateral/system/tankDODict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      tankDODict;
}

functions
{
    loadDOFields
    {
        type            readFields;
        libs            (fieldFunctionObjects);

        fields
        (
            DO
            alpha.water
        );
    }

    tankDO
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);

        log             true;
        writeFields     false;

        regionType      all;
        operation       weightedVolAverage;
        weightField     alpha.water;

        fields
        (
            DO
        );
    }
}
