cases/aeration/CaseC_Lateral/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    // Left lateral diffuser bank
    {
        name    diffuserFaces;
        type    faceSet;
        action  new;
        source  boxToFace;

        sourceInfo
        {
            box
                (1.999999 0.499999 -0.000001)
                (38.000001 1.000001 0.000001);
        }
    }

    // Right lateral diffuser bank
    {
        name    diffuserFaces;
        type    faceSet;
        action  add;
        source  boxToFace;

        sourceInfo
        {
            box
                (1.999999 3.999999 -0.000001)
                (38.000001 4.500001 0.000001);
        }
    }
);

// ************************************************************************* //
